## Q5-Write a Pandas program to get the powers of an array values element-wise.

In [1]:
import pandas as pd
import numpy as np 

df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print(df)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

## Q6-Write a Pandas program to get the first 3 rows of a given DataFrame.

In [31]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael','Matthew', 'Laura', 'Kevin', 'Jonas'],
            'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
            'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
            'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df2=pd.DataFrame(exam_data, index=labels)
print(df2.iloc[:3])

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

## Q7- Write a Pandas program to display the default index and set a column as an Index in a given dataframe

In [12]:
test_data = {
             'address':["street1","street2","street3","street4","street5","street6"],
             'school_code':["s001","s002","s003","s004","s005","s006"],
             'class':["v","v","vi","vi","v","vi"],
             'first_name':["Alberto","Gino","Ryan","Eesha","Gino","David"],
             'last_name':["Franco","Mcneill","Parkes","Hinton","Mcneill","Parkes"],
             'date_of_birth':["15/05/2002","17/05/2002","16/02/1999","25/09/1998","11/05/2002","15/09/1997"],
             'weight':[35,32,33,30,31,32],
             't_id':['t1','t2','t3','t4','t5','t6']
            }

df3=pd.DataFrame(test_data)
print("Default index :")
print(df3)

Default index :
   address school_code class first_name last_name date_of_birth  weight t_id
0  street1        s001     v    Alberto    Franco    15/05/2002      35   t1
1  street2        s002     v       Gino   Mcneill    17/05/2002      32   t2
2  street3        s003    vi       Ryan    Parkes    16/02/1999      33   t3
3  street4        s004    vi      Eesha    Hinton    25/09/1998      30   t4
4  street5        s005     v       Gino   Mcneill    11/05/2002      31   t5
5  street6        s006    vi      David    Parkes    15/09/1997      32   t6

In [13]:
print("t_id as index")
ndf1=df3.set_index('t_id')
print(ndf1)

t_id as index
      address school_code class first_name last_name date_of_birth  weight
t_id
t1    street1        s001     v    Alberto    Franco    15/05/2002      35
t2    street2        s002     v       Gino   Mcneill    17/05/2002      32
t3    street3        s003    vi       Ryan    Parkes    16/02/1999      33
t4    street4        s004    vi      Eesha    Hinton    25/09/1998      30
t5    street5        s005     v       Gino   Mcneill    11/05/2002      31
t6    street6        s006    vi      David    Parkes    15/09/1997      32

## Q8- reset the index

In [15]:
print("reset index")
ndf2=ndf1.reset_index(inplace=False)
print(ndf2)

reset index
  t_id  address school_code class first_name last_name date_of_birth  weight
0   t1  street1        s001     v    Alberto    Franco    15/05/2002      35
1   t2  street2        s002     v       Gino   Mcneill    17/05/2002      32
2   t3  street3        s003    vi       Ryan    Parkes    16/02/1999      33
3   t4  street4        s004    vi      Eesha    Hinton    25/09/1998      30
4   t5  street5        s005     v       Gino   Mcneill    11/05/2002      31
5   t6  street6        s006    vi      David    Parkes    15/09/1997      32

## Q9-Write a Pandas program to create a dataframe indexing by date and time

In [32]:
print("indexing by date and time :")
dt_range = pd.date_range(start = '2020-05-12  07:10:10', freq = 'S' ,periods =6)
ndf3=pd.DataFrame(test_data , index = dt_range)
print(ndf3)

indexing by date and time :
                     address school_code class first_name last_name  \
2020-05-12 07:10:10  street1        s001     v    Alberto    Franco
2020-05-12 07:10:11  street2        s002     v       Gino   Mcneill
2020-05-12 07:10:12  street3        s003    vi       Ryan    Parkes
2020-05-12 07:10:13  street4        s004    vi      Eesha    Hinton
2020-05-12 07:10:14  street5        s005     v       Gino   Mcneill
2020-05-12 07:10:15  street6        s006    vi      David    Parkes

                    date_of_birth  weight t_id
2020-05-12 07:10:10    15/05/2002      35   t1
2020-05-12 07:10:11    17/05/2002      32   t2
2020-05-12 07:10:12    16/02/1999      33   t3
2020-05-12 07:10:13    25/09/1998      30   t4
2020-05-12 07:10:14    11/05/2002      31   t5
2020-05-12 07:10:15    15/09/1997      32   t6

## Q10-Write a Pandas program to create a dataframe and set a title or name of the index column.

In [29]:
ndf1.index.name="Index_name"
print(ndf1)

            address school_code class first_name last_name date_of_birth  \
Index_name
t1          street1        s001     v    Alberto    Franco    15/05/2002
t2          street2        s002     v       Gino   Mcneill    17/05/2002
t3          street3        s003    vi       Ryan    Parkes    16/02/1999
t4          street4        s004    vi      Eesha    Hinton    25/09/1998
t5          street5        s005     v       Gino   Mcneill    11/05/2002
t6          street6        s006    vi      David    Parkes    15/09/1997

            weight
Index_name
t1              35
t2              32
t3              33
t4              30
t5              31
t6              32

In [30]:
ndf1

,address,school_code,class,first_name,last_name,date_of_birth,weight
Index_name,,,,,,,
t1,street1,s001,v,Alberto,Franco,15/05/2002,35
t2,street2,s002,v,Gino,Mcneill,17/05/2002,32
t3,street3,s003,vi,Ryan,Parkes,16/02/1999,33
t4,street4,s004,vi,Eesha,Hinton,25/09/1998,30
t5,street5,s005,v,Gino,Mcneill,11/05/2002,31
t6,street6,s006,vi,David,Parkes,15/09/1997,32